---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleMultiPlanarShape
source: html/ad509efd-ac26-dc5d-54cd-1cb1c28d69ac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleMultiPlanarShape Property

A circle can't be converted to multiplanar shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircleMultiPlanarShape { get; }
```